# FamilyStructFootingUseCapTop Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..FamilyStructFootingUseCapTop Property
ParameterTypeId Class See Also
---
"Cap"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId FamilyStructFootingUseCapTop { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyStructFootingUseCapTop As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ FamilyStructFootingUseCapTop {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace